#+OPTIONS: toc:nil ^:nil author:nil date:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+TITLE: org-doc

* Org Doc
** 本文参考
*** [[http://doc.norang.ca/org-mode.html][Org-Mode GTD]]
*** [[http://orgmode.org/orgcard.txt][Org-Mode Shortcuts]]

*** [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs configuration]]
** 段落
win下只要你Enter，就换行成为新的一段了。但是这里要开始新的段落需要回车两次，当你回车一次，当你发布时，只相当于中间有个空格而已。还有一种方法就是在需要空格的地方输入。
段落一
段落二
段落三
*粗体*
/斜体/
+删除线+
_下划线_
下标： H_2 O(这里必须留一个空格要不然2和O都成为小标，目前还不知道怎么去掉空格)
上标： E=mc^2
等宽字：  =git=
效果为： 粗体
斜体
删除线
下划线
下标：H2 O
上标：E=mc2
等宽字： git
** 列表
   #+BEGIN_SRC example
   这里有有序和无序两种，还有一种描述列表。
   无序列表以'-'、'+'或者'*'开头
   有序列表以'1.'或者'1)'开头
   描述列表用'::'
   注意事项
   列表符号后面都要有空格
   同级别的列表缩进要相同
   如果想要加入同级别的列表，可以 M-RET
   空两行之后列表结束，如果空一行执行M-RET，实际上还是输入同级项
   #+END_SRC
** 列表/标题快捷键
#+BEGIN_SRC example
快捷键  说明
S-TAB   循环切换整个文档的大纲状态（折叠、打开下一级、打开全部）
TAB     循环切换光标所在的大纲状态
大纲或者列表之间移动
快捷键  说明
C-c C-n/p   移动到下上一个标题（不断标题是哪一级）
C-c C-f/b   移动到同一级别的下/上标题
C-c C-u     跳到上一级标题
C-c C-j     切换到大纲预览状态
基于大纲/标题的编辑
快捷键  说明
M-RET   插入一个同级别的标题
M-S-RET     插入一个同级别的TODO标题
M-LEFT/RIGHT    将当前标题升/降级
M-S-LEFT/RIGHT  将子树升/降级
M-S-UP/DOWN     将子树上/下移动
C-c *   将本行设为标题或者正文
C-c C-w     将子树或者区域移动到另一个标题处（跨缓冲区）
C-c C-x b   在新缓冲区显示当前分支
C-c /   只列出包含搜索结果的大纲，并高亮，支持多种搜索方式
#+END_SRC
** 嵌入元数据
#+BEGIN_SRC example
org-mode中有以下几种

s    #+begin_src ... #+end_src
e    #+begin_example ... #+end_example  : 单行的例子以冒号开头
q    #+begin_quote ... #+end_quote      通常用于引用，与默认格式相比左右都会留出缩进
v    #+begin_verse ... #+end_verse      默认内容不换行，需要留出空行才能换行
c    #+begin_center ... #+end_center
l    #+begin_latex ... #+end_latex
L    #+latex:
h    #+begin_html ... #+end_html
H    #+html:
a    #+begin_ascii ... #+end_ascii
A    #+ascii:
i    #+index: line
I    #+include: line
代码
上面的单字母为快捷键字母，如输入一个<s 然后TAB后就变为：
\#+begin_src
\#+end_src
上面的代码我们还可以加入一些参数，如

\#+begin_src c -n -t -h 7 -w 40
\#+end_src
其中：
c为所添加的语言
-n 显示行号
-t 清除格式
-h 7 设置高度为7 -w 40设置宽度为40
注释
以‘#‘开头的行被看作注释，不会被导出区块注释采用如下写法：
#+BEGIN_COMMENT
  块注释
  ...
#+END_COMMENT
#+END_SRC
** 表格与图片
对于表格和图片，可以在前面增加标题和标签的说明，以方便交叉引用。比如在表格的前面添加：
#+CAPTION: This is the caption for the next table (or link)
则在需要的地方可以通过
#+BEGIN_EXAMPLE
\ref{table1}
#+END_EXAMPLE
来引用该表格。

嵌入html
对于导出html以及发布，嵌入html代码就很有用。比如下面的例子适用于格式化为cnblogs的代码块：

 #+BEGIN_EXAMPLE
 <div class="cnblogs_Highlighter">
 <pre class="brush:cpp">
 int main()
 {
    return 0;
 }
 </pre>
 </div>
 #+END_EXAMPLE

包含文件
当导出文档时，你可以包含其他文件中的内容。比如，想包含你的“.emacs”文件，你可以用：
 #+BEGIN_SRC example
 #+INCLUDE: "~/.emacs" src emacs-lisp
 #+END_SRC
可选的第二个第三个参数是组织方式（例如，“quote”，“example”，或者“src”），如果是 “src”，语言用来格式化内容。组织方式是可选的，如果不给出，文本会被当作 Org 模式的正常处理。用 C-c ,可以访问包含的文件。

** 文档元数据

Export options 我们除了手动添加上面的元数据外，还可以用快捷键 C-c C-e t 插入选项，其中可能有些选项我们需要经常用到：
#+BEGIN_SRC example
H:  标题层数
num:    章节(标题)是否自动编号
toc:    是否生成索引
creator:    是否生成 "creat by emacs…"
LINKUP:     UP: 链接
LINKHOME:   HEME: 链接
#+END_SRC
** 表格

有时候，表格的某一项特别的长，你可以在任意一个表格的空白项内输入数字来限制其所在列的长度。比如：
#+BEGIN_EXAMPLE
|   | <6>    |
| 1 | one    |
| 2 | two    |
| 3 | This=> |
| 4 | four   |
#+END_EXAMPLE
在上面的例子中，第二列的长度不会超过6，超过的部分会被隐藏起来。你可以把鼠标移动到’This=>’上面，
会有浮动标签显示出该项的内容，或者输入’C-c `’可以编辑被隐藏的内容。如果你发现表格的某一项没有如
你预期的那样被隐藏起来，你可以在表格中的任意位置按 ‘C-c C-c’。

我们还可以把表格弄的更好看一些。在表格的某两行之间加入’|-’，然后按TAB，可以作出下面的效果：
#+BEGIN_EXAMPLE
|   | <6>    |
|---+--------|
| 1 | one    |
| 2 | two    |
| 3 | This=> |
| 4 | four   |
#+END_EXAMPLE

*** 快捷键
#+BEGIN_SRC example
整体区域
操作    说明
C-c 竖线    创建或者转化成表格
C-c C-c     调整表格，不移动光标
TAB     移动到下一区域，必要时新建一行
S-TAB   移动到上一区域
RET     移动到下一行，必要时新建一行
编辑行和列
快捷键  说明
M-LEFT/RIGHT    移动列
M-UP/DOWN   移动行
M-S-LEFT/RIGHT  删除/插入列
M-S-UP/DOWN     删除/插入行
C-c -   添加水平分割线
C-c RET     添加水平分割线并跳到下一行
C-c ^   根据当前列排序，可以选择排序方式
#+END_SRC
*** 表格中的计算

例如一张价格表：

数量    单价    总额
2   3.45
4   4.34
5   3.44
5   5.6
在第二行第三列中输入'=$1*$2′。$1和$2表示第一列和第二列，在你自己的表格中，你会使用你希望的列数进行计算。
#+BEGIN_SRC example
| 数量 | 单价 | 总额 |
|------+------+-------|
|    2 | 3.45 |   6.9 |
|    4 | 4.34 | 17.36 |
|    5 | 3.44 |  17.2 |
|    5 |  5.6 |   28. |
#+TBLFM: $3=$1*$2
#+END_SRC
你可以输入’C-u C-c C-c’强制org mode为整个表格进行计算。如果你不想让某一列都按照公式计算，只希望在某一特定项上进行计算，你可以这样输入：':=$1*$2′, 即在等号前再加一个冒号。

** 连接
内部链接就类似于HTML的锚点（实际上export成HTML文件后就变成了锚点），可以实现在一个文档内部的跳转。如下命令定义了一个名为target的跳转目标：

#<<target>> (这里我把锚点设置到*连接*这一部分开始处，大家可以点击下面效果中两个连接试试效果)
如下方式可以设置到target的链接：
#+BEGIN_EXAMPLE
[[target]] 或 [[target][猛击锚点]]
#+END_EXAMPLE
效果为： target 或 猛击锚点

C-c l 可以在光标所在处创建一个跳转目标点，在需要跳转至该目标的位置输入命令C-c C-l可以建立到目标的链接当输入C-c C-l命令，光标若处在已经存在的一个链接上的时候，可以编辑改链接。命令C-c %可以记录当前光标所在位置，当光标移到其他地方后，可以用C-c &跳转回来。这里的位置记录类似一个 kill-ring，重复输入C-c %可以记录多个位置，重复输入C-c &可以连续跳转到之前记录的对应位置上。

** 注脚

在 org mode 中，你可以为你的文章添加注脚（footnote）。注脚的格式有两种，一是方括号+数字，二是方括号+fn+名字。比如下面有两个例子：在 org mode 的正文中写下这两句话：

The Org homepage1 now looks a lot better than it used to. The Org homepage2 now looks a lot better than it used to.

插入脚注：C-c C-x f 接下俩你可以写一些其他东西，然后在文章的末尾写上下面两句话（注意：必须要顶格写）：
#+BEGIN_SRC example
[1] The link is: http://orgmode.org
[fn:orghome] The link is: http://orgmode.org
#+END_SRC
把光标移动到正文的1处，按 C-c C-c，可以跳转到注脚1处，在注脚1处按 C-c C-c，可以跳转到正文的1 处。

** 分割线
五条短线或以上显示为分隔线。

-----
** 标签tag
#+BEGIN_SRC example
快捷键  说明
C-c \   可以用来查找某个tag下的所有项目
C-c / m     搜索并按树状结构显示
C-c a m     从所有agenda file里建立符合某tag的全局性列表
+   和      a+b   同时有这两个标签
-   排除    a-b   有 a 但没有 b
|   或      a|b   有 a 或者有 b
&   和      a&b   同时有 a 和 b，可以用“+”替代
在查询视图中 C-c C-c 退出
#+END_SRC

** 发布
#+BEGIN_SRC example
发布相关的命令：

命令    说明
C-c C-e C   提示指明一个项目，将所有的文件发布
C-c C-e P   发布包含当前文件的项目
C-c C-e F   只发布当前文件
C-c C-e E   发布所有项目
#+END_SRC

** 附录
#+BEGIN_SRC example

"emacs-lisp" "python" "C" "sh" "java" "js" "clojure" "C++" "css"
"calc" "asymptote" "dot" "gnuplot" "ledger" "lilypond" "mscgen"
"octave" "oz" "plantuml" "R" "sass" "screen" "sql" "awk" "ditaa"
"haskell" "latex" "lisp" "matlab" "ocaml" "org" "perl" "ruby"
"scheme" "sqlite"

c-c c-s Scheduled
c-c c-d Deadline
#+END_SRC